# Up to ABC, run without flattening to hide (most) loops and speed things up
synth_ice40 -noflatten -top top -run :map_cells
# Make names a bit smaller and flatten
rename -enumerate *
opt_clean -purge
flatten
opt_clean -purge
# Most LUTs now have constant inputs, optimise them
opt_lut -dlogic SB_CARRY:I0=2:I1=1:CI=0
# Final stages of iCE40 mapping
synth_ice40 -run map_cells:
